app/Controllers/AuthController.php

            //Creamos el objeo de la clase que tiene la estructura de la tabla usuarios
            $tablaUsuariosModelo = new UsuarioModel();
            //Guardamos los datos en dicho objeto y con "SAVE" lo metemos en la BD
            $query = $tablaUsuariosModelo->save($datosFormularioRegistro);
---
INSERT INTO `usuarios` (`nombre`, `apellido`, `email`, `password`) VALUES ('Matias Jose', 'Martinez', 'mati.j.martinez@gmail.com', '$2y$10$EdzXkGdS3sFR1sHZBGaHju0qBGS4J0VftcuensKtQW.rLeQShisHC')


            $tablaUsuariosModelo = new UsuarioModel();
            //Ponemos en una variable al usuario que obtenemos en una busqueda en la BD
            $informacion_usuario_login = $tablaUsuariosModelo->where('email', $email)->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'mati.j.martinez@gmail.com'
 LIMIT 1